In [1]:
import os

import math

import numpy as np
import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')

In [2]:
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Carol', 'Dave', 'Eve', 'Frank'],
    'gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'age': [24, 34, 44, 41, 52, 43],
    'marital_status': [0, 2, 1, 2, 0, 1]}).\
        set_index('name')

In [3]:
df

       age  gender  marital_status
name
Alice   24  Female               0
Bob     34    Male               2
Carol   44  Female               1
Dave    41    Male               2
Eve     52  Female               0
Frank   43    Male               1

In [6]:
df[['age','gender']]

       age  gender
name
Alice   24  Female
Bob     34    Male
Carol   44  Female
Dave    41    Male
Eve     52  Female
Frank   43    Male

In [7]:
df['age']

name
Alice    24
Bob      34
Carol    44
Dave     41
Eve      52
Frank    43
Name: age, dtype: int64

In [10]:
df[['age']]

       age
name
Alice   24
Bob     34
Carol   44
Dave    41
Eve     52
Frank   43

In [15]:
df[[0,1]]

       age  gender
name
Alice   24  Female
Bob     34    Male
Carol   44  Female
Dave    41    Male
Eve     52  Female
Frank   43    Male

In [16]:
df[['age']]

       age
name
Alice   24
Bob     34
Carol   44
Dave    41
Eve     52
Frank   43

In [26]:
df[[2,-2]]

       marital_status  gender
name
Alice               0  Female
Bob                 2    Male
Carol               1  Female
Dave                2    Male
Eve                 0  Female
Frank               1    Male

In [18]:
df['age']

name
Alice    24
Bob      34
Carol    44
Dave     41
Eve      52
Frank    43
Name: age, dtype: int64

In [19]:
df.age

name
Alice    24
Bob      34
Carol    44
Dave     41
Eve      52
Frank    43
Name: age, dtype: int64

In [21]:
df

       age  gender  marital_status
name
Alice   24  Female               0
Bob     34    Male               2
Carol   44  Female               1
Dave    41    Male               2
Eve     52  Female               0
Frank   43    Male               1

In [23]:
df.loc[['Bob','Carol','Frank']]

       age  gender  marital_status
name
Bob     34    Male               2
Carol   44  Female               1
Frank   43    Male               1

In [27]:
df.iloc[[1,2]]

       age  gender  marital_status
name
Bob     34    Male               2
Carol   44  Female               1

In [29]:
df.loc[['Eve']]

      age  gender  marital_status
name
Eve    52  Female               0

In [30]:
df.iloc[[4]]

      age  gender  marital_status
name
Eve    52  Female               0

In [31]:
df.loc['Eve']

age                   52
gender            Female
marital_status         0
Name: Eve, dtype: object

In [32]:
df.iloc[4]

age                   52
gender            Female
marital_status         0
Name: Eve, dtype: object

In [33]:
df.at['Frank','age']

43

In [34]:
df.iat[5,0]

43

In [35]:
df.loc['Frank']['age']

43

In [37]:
df.loc['Frank'].age

43

In [38]:
df['age']['Frank']

43

In [39]:
df.age.Frank

43

In [40]:
print "Men's mean age =", df[df.gender == 'Male'].age.mean()
print "Women's median age =", df[df.gender == 'Female'].age.median()

Men's mean age = 39.3333333333
Women's median age = 44.0

In [42]:
df[df.gender == 'Male'].age.mean()
#df[df.gender == 'Female'].age.median()

39.333333333333336

In [47]:
df.age.mean()

39.666666666666664